# Напишіть програму "Касир в кінотеатрі", яка буде виконувати наступне:
#
# Попросіть користувача ввести свій вік (можна використати константу або input()).
# - якщо користувачу менш ніж 7 - вивести "Де твої батьки?"
# - якщо користувачу менш ніж 16 - вивести "Це фільм для дорослих!"
# - якщо користувачу більш ніж 65 - вивести "Покажіть пенсійне посвідчення!"
# - якщо вік користувача складається з однакових цифр (11, 22, 44 і тд років, всі можливі варіанти!) - вивести
# "Який цікавий вік!" - у будь-якому іншому випадку - вивести "А білетів вже немає!"

print('Будь ласка, введіть ваш повний вік у числовому форматі:')
age = input()

age_clear = age.strip()  # Чистимо введене значення від помилкових пробілів перед та після введених даних

if age_clear.isdigit() and int(age_clear) != 0:  # Перевірка на коректність даних та на 0. Зводимо до int, якщо все ок
    age_int = int(age_clear)
    if len(str(age_int)) > 1 and age_clear.count(age_clear[0]) == len(age_clear):  # Перевірка на repdigit
        print('Який цікавий вік!')
    else:
        if age_int < 7:  # Основна логіка програми
            print('Де твої батьки?')
        elif 7 <= age_int < 16:
            print('Це фільм для дорослих!')
        elif age_int >= 65:
            print('Покажіть пенсійне посвідчення!')
        else:
            print('А білетів вже немає!')
else:
    print('Потрібно ввести ціле число більше 0.')